package com.example.tytytest

/* Здравствуйте)
Сразу скажу, проект  может крашиться из-за ip. Вдимо TheMovieDB заблокировал свои данные для русскоязычных пользователей
и по этому лично у меня Api блокируется. С VPN проблема пропадает. Заранее извиняюсь за неудобство)

Так извиняюсь за некоторые косяки в приложениях, такие как context в viewModel, я слышал, что так делать нельзя, но на
данный момент не совсем разобрался почему нельзя, и боялся, что наворочу кашу, которую сам не смогу разобрать)

Спасибо за внимание)
 */